#include <stdio.h>

int main() {
    int a[3][5] = {{1,  2,  3,  4,  5},
                   {6,  7,  8,  9,  10},
                   {11, 12, 13, 14, 15}};
    int (*p)[5];
    p = a;
    printf("a=%p\n", a);//一维数组指针
    printf("a+1=%p\n", a + 1);//相差20个字节

    /*数组指针取* ,并不是取值的意思,而是指针的类型发生变化(降级)  */
    printf("*a=%p\n", *a);//*a是a[0][0]的地址,即&a[0][0]  整形指针
    printf("*a+1=%p\n", *a + 1);//*a+1是&a[0][1] 相差4个字节

    printf("%p\n", p);
    printf("%p\n", p + 1);//相差20个字节
    printf("%p\n", *p);//一维数组指针取 *,结果为整形指针  二维数组指针取*,结果为一维数组指针,以此类推
    printf("%p\n", *p + 1);//相差4个字节

    printf("%d\n", *(*p));//a[0][0]
    printf("%d\n", *((*p) + 1));//a[0][1]

    printf("%d\n", *(*(p + 1) + 1));//a[1][1]
    return 0;
}